## Pandas Map, Apply, Lambda
## 20180725
## Sungjae Lee

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series

### lambda

In [3]:
f = lambda x, y: x + y
f(1,4)

5

In [5]:
def f(x , y):
    return x + y
f(1, 4)

5

In [6]:
f = lambda x: x ** 2
f(3)

9

In [7]:
f = lambda x : 2 ** x
f(3)

8

In [9]:
(lambda x : x + 1)(5)

6

### map & replace

In [11]:
ex = [1,2,3,4,5]
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [12]:
f = lambda x, y: x + y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [13]:
list(map(lambda x : x + 5, ex))
#python 3에는 list를 꼭 붙여줘야함

[6, 7, 8, 9, 10]

In [14]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [16]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [18]:
s1 = Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [19]:
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [22]:
s2 = Series(np.arange(10,20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [18]:
# !wget https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv

In [23]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [25]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [28]:
df["sex_code"] =  df.sex.map({'male':0, 'female':1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [29]:
df.sex.replace({
    'male':0, 'female':1
}).head(5)

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [39]:
df.sex.replace(['male', 'female'],
              [0, 1], inplace = True)
df.sex.head(5)

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [41]:
df.sex.replace([0, 1],
               ['male', 'female']
              , inplace = True)
df.sex.head(5)

0      male
1    female
2    female
3    female
4    female
Name: sex, dtype: object

In [42]:
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

### apply & applymap

In [43]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [44]:
df_info = df[['earn', 'height', 'age']]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [47]:
f = lambda x : x.max() - x.min()
df_info.apply(f)
#column별 최대값과 최소값의 차이

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [48]:
f = lambda x : max(x) - min(x)
df_info.apply(f)
#column별 최대값과 최소값의 차이

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [49]:
df_info.sum()

#apply함수를 적용해서 칼럼별 합

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [50]:
df_info.apply(sum)

# 칼럼별 합

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [51]:
def f(x):
    return Series([x.min(), x.max(), x.mean()],
                 index = ['min', 'max', 'mean'])

In [56]:
df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499

In [57]:
f = lambda x : -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [58]:
f = lambda x : -x
df_info['earn'].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64